{
  "layout": {
    "sidebar": {
      "contacts": "Обо мне",
      "cv": "Резюме",
      "projects": "Проекты"
    },
    "footer": {
      "madeby": "сайт сделал"
    }
  },
  "page": {
    "index": {
      "name": "Дмитрий Дударев",
      "description": "Привет! Я Front-End разработчик, увлекаюсь созданием различного рода приложений более 5 лет.",
      "stack": "Сейчас мой любимый стэк состоит из",
      "cv": "Резюме"
    },
    "project": {
      "stack": "Стек технологий"
    }
  },
  "skills": {
    "nextjs": {
      "description": "На данный момент лучший React (да и в целом) мета-фреймворк по моему мнению, очень удобный роутинг с SSR и SSG функционалом."
    },
    "react": {
      "description": "Наиболее удобный для меня JS фреймворк за счёт его приближённости к нативному JS. NextJS построен поверх него."
    },
    "typescript": {
      "description": "Типизация для JavaScript, мастхев, современные проекты без него существовать не могут."
    },
    "tailwind": {
      "description": "Невероятно удобный инструмент для быстрой стилизации, на котором построено много потрясающих UI библиотек."
    },
    "shadcn": {
      "description": "Необычный, полностью кастомизируемый UI kit на TailwindCSS, использую во всех новых проектах."
    },
    "zustand": {
      "description": "Быстрый, масштабируемый State менеджер построенный на принципах Flux и Immutable flex."
    },
    "reactquery": {
      "description": "Хуки для управления запросами, обычно использую в паре с Axios для коммуникации по API."
    },
    "automapper": {
      "description": "Библиотека для автоматического приведения типов (и классов), предоставляющая удобный функционал конфигурирования."
    },
    "awss3": {
      "description": "S3 - облачное объектное хранилище, позволяющее в любой момент воспользоваться файлами в нём и масштабировать его объём."
    },
    "chromium": {
      "description": "Браузерный движок, позволяющий отображать веб страницы"
    },
    "docker": {
      "description": "Инструмент для контейнеризации приложений, позволяющий развертывать и управлять ими одним кликом."
    },
    "dotnet": {
      "description": "Современная среда разработки, основанная на C#. Я использую её для написания как API серверов, так и для создания desktop приложений."
    },
    "efcore": {
      "description": "Мощный ORM для работы с SQL базами данных в .NET"
    },
    "grpc": {
      "description": "Протокол для синхронного обмена сообщениями между приложениями, построенный на базе HTTP."
    },
    "heroui": {
      "description": "UI библиотека для создания адаптивных приложений, построенная на React и TailwindCSS. Полностью оптимизирована для NextJS (и других SSR фреймворков)."
    },
    "mantine": {
      "description": "Библиотека для создания компонентов интерфейса пользователя, построенная на TypeScript и React."
    },
    "prisma": {
      "description": "ORM для работы с SQL базами данных в NodeJS, построенный на базе GraphQL. Использую при создании простых API путей в NextJS."
    },
    "rabbitmq": {
      "description": "Брокер сообщений, позволяющий обменять сообщениями между приложениями. Обязателен (или его аналог) при построении back-end с микросервисной архитектурой."
    },
    "wpf": {
      "description": "Фреймворк для создания desktop приложений, основанный на .NET"
    }
  }
}
